programming/20220429153134-nixos_python.org
:PROPERTIES:
:ID:       018850fc-57de-4163-870f-cbd906e8516f
:ROAM_TAGS:
:END:
#+title: nixos-python
#+CREATED: [2022-12-17 12:03:14]
#+LAST_MODIFIED: [2023-04-30 Sun 21:29]
** Setting up a python dev enviroment in nix
The python packaging on nim is very lacking and often require you to build/hack around/bend nix to your will

*** Impure Dev setup with pipenv
For most of the projects i often use a shell.nix and pipenv
i will be moving to flakes as they seem more robust for packaging lib dirtrobutions

**** shell.nix
if you prefer to use `shell.nix`
then copy paste this into your shell.nix

#+begin_src nix
with import <nixpkgs> {};
let
  manyLinuxFile =
    writeTextDir "_manylinux.py"
      ''
        print("in _manylinux.py")
        manylinux1_compatible = True
      '';
in
buildFHSUserEnv {
  name = "my-python-env";
  targetPkgs = pkgs: with pkgs; [
    python3
    pipenv
    which
    gcc
    binutils
    manyLinuxFile

    # playwright stuff
    playwright
    nodejs


    # All the C libraries that a manylinux_1 wheel might depend on:
    ncurses
    xorg.libX11
    xorg.libXext
    xorg.libXrender
    xorg.libICE
    xorg.libSM
    glib
    stdenv.cc.cc.lib
  ];

  runScript = "$SHELL";
}
#+end_src


*** Pure nix flakes
the nix community have a number of tools for managing python packages

**** mach-nix
Mach-nix makes it easy to create and share reproducible python environments or packages. Existing tools for python package management often suffer from reproducibility and complexity issues, requiring a multitude of tools and additional virtualization layers to work sufficiently. Mach-nix aims to solve these problems by providing a simple way to use nix, a revolutionary build system which is known to achieve great reproducibility and portability besides [many other advantages](https://nixos.org/features.html).

This allows you to build and manage custom python envrioments/shells

There is a template  that can be found [[https://github.com/Quoteme/mach-nix-template]]

you can use the template by
#+begin_src shell
nix flake new yourNewPythonProjectName -t github:Quoteme/mach-nix-template/3e941e598b7438abd5f22c795c378ce215430bff
#+end_src
And to enter it
#+begin_src
nix develop
#+end_src
